app/controllers/process_controller.rb

    def home
        @count = Message.where(completed: true).count
---
SELECT COUNT(*) FROM "messages" WHERE "messages"."completed" = $1  [["completed", true]]